app/controllers/applications_controller.rb

    def index
      render json: Application.all
---
SELECT "applications".* FROM "applications"