app/controllers/employers_controller.rb

  def index
    render json: Employer.all
---
SELECT "employers".* FROM "employers"

  def show
    employer= Employer.find(params[:id])
---
SELECT "employers".* FROM "employers" WHERE "employers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    employer=Employer.find(params[:id])
    employer.update!(employer_params)
---
SELECT "employers".* FROM "employers" WHERE "employers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "employers" SET "company_name" = $1, "company_location" = $2, "company_description" = $3, "company_logo" = $4, "updated_at" = $5 WHERE "employers"."id" = $6

  def employer_opportunities
    jobs = Opportunity.where(employer_id: params[:employer_id])
---
SELECT "opportunities".* FROM "opportunities" WHERE "opportunities"."employer_id" = $1  [["employer_id", 1]]