app/controllers/opportunities_controller.rb

  def index
    render json: Opportunity.all
---
SELECT "opportunities".* FROM "opportunities"

  def create
    employer= Employer.find(params[:employer_id])
---
SELECT "employers".* FROM "employers" WHERE "employers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]