app/controllers/profiles_controller.rb

  def index
    render json: Profile.all
---
SELECT "profiles".* FROM "profiles"

  def show
    profile= Profile.find(params[:id])
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    profile=Profile.find(params[:id])
    profile.update!(profile_params)
---
SELECT "profiles".* FROM "profiles" WHERE "profiles"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "profiles" SET "full_name" = $1, "phone_number" = $2, "date_of_birth" = $3, "skills" = $4, "biography" = $5, "resume" = $6, "profile_picture" = $7, "updated_at" = $8 WHERE "profiles"."id" = $9