app/controllers/sessions_controller.rb

    def create
        user= User.find_by(email_address:params[:email_address])
        if user&.authenticate(params[:password])
            if(params[:user_type]=="Admin")
                admin= User.find_by(id:user.id)
                if(admin.is_admin==true)
                    render json: admin
                end

            elsif (params[:user_type]=="Employer")
                employer= Employer.find_by(user_id:user.id)
                if employer
                    render json: employer
                else
                    render json: {errors:["Employer does not exist under this email"]}, status: :not_found
                end
            elsif((params[:user_type]=="Jobseeker"))
                profile= Profile.find_by(user_id:user.id)
---
SELECT "users".* FROM "users" WHERE "users"."email_address" = $1 LIMIT $2  [["email_address", "dl679@ymail.com"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "employers".* FROM "employers" WHERE "employers"."user_id" = $1 LIMIT $2  [["user_id", 9], ["LIMIT", 1]]
SELECT "profiles".* FROM "profiles" WHERE "profiles"."user_id" = $1 LIMIT $2  [["user_id", 6], ["LIMIT", 1]]