app/controllers/users_controller.rb

INSERT INTO "users" ("email_address", "password_digest", "is_admin", "user_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
INSERT INTO "profiles" ("user_id", "full_name", "phone_number", "date_of_birth", "skills", "biography", "resume", "profile_picture", "email_address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
---
    def create
        user = User.create!(user_params)
        if user
            if (params[:user_type]=="Employer")
            employer= Employer.create!(user_id:user.id, full_name:params[:full_name],email_address:params[:email_address] )
            render json: employer
            else
            profile= Profile.create!(user_id:user.id, full_name:params[:full_name],email_address:params[:email_address])